app/controllers/alumni_controller.rb

INSERT INTO "alumni" ("uin", "cohort_year", "team_affiliation", "profession_title", "availability", "email", "phone_number", "biography", "created_at", "updated_at") VALUES (432003567, 2022, 'Mighty Ducks', 'Pediatric Surgeon', TRUE, 'karl.j.farrar@tamu.edu', '682-472-8670', 'I''m just testing out how I can make a  new alumnus', '2025-02-15 16:16:48.965956', '2025-02-15 16:16:48.965956') RETURNING "id"
---
  def create
    Rails.logger.info "Creating a new ALUMNI"
    Rails.logger.debug "Params: #{params.inspect}"

    @alumnus = Alumnus.new(alumnus_params)

    Rails.logger.info "UID: #{session[:uid]}"
    Rails.logger.info "Email: #{session[:email]}"
    Rails.logger.info "avatar_url: #{session[:avatar_url]}"

    @alumnus.user.status = "alumni"

  if @alumnus.save